open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/common/bk7258_rptun_mbox.c
/****************************************************************************
 * chips/bk7258/common/
 * bk7258_rptun_mbox.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * N9 CP/AP MBOX0 transport wrapper.  The Beken SDK owns the device/FIFO,
 * physical callbacks and logical-channel ACK machinery.  This wrapper
 * reserves MB_CHNL_LOG for RPTUN edge notifications and defers all protocol
 * work from the SDK logical-channel ISR to a pinned NuttX kthread.
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#ifdef CONFIG_BK7258_RPTUN_MBOX

#include <errno.h>
#include <stdbool.h>
#include <sched.h>
#include <stdint.h>
#include <string.h>
#include <sys/types.h>

#include <nuttx/clock.h>
#include <nuttx/kthread.h>
#include <nuttx/sched.h>
#include <nuttx/semaphore.h>
#include <nuttx/spinlock.h>

#include <arch/chip/bk7258_amp.h>
#include <arch/chip/bk7258_rptun.h>

#include <common/bk_err.h>
#include <driver/mailbox_channel.h>

#include "bk7258_rptun_mbox.h"
#include "bk7258_sdk_abi.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define BK7258_RPTUN_MBOX_TYPE_COUNT       6u
#define BK7258_RPTUN_MBOX_WORKER_NAME      "bk7258-rptun-rx"
#define BK7258_RPTUN_MBOX_CHANNEL          MB_CHNL_LOG
#define BK7258_PM_WAKE_MBOX_CHANNEL         MB_CHNL_PWC
#define BK7258_PM_SLEEP_WAKEUP_NOTIFY_CMD   0x10u
#define BK7258_RPTUN_MBOX_POLL_MS          1u

#ifdef CONFIG_BK7258_AP_CORE
extern bool bk7258_pm_ap_release_peer(void) weak_function;
#endif

static_assert(sizeof(mb_chnl_cmd_t) == BK7258_RPTUN_MBOX_DATA_LENGTH,
              "BK7258 SDK logical mailbox command ABI drift");
static_assert(GET_LOG_CHNL_ID(BK7258_RPTUN_MBOX_CHANNEL) ==
              BK7258_RPTUN_MBOX_LOGICAL_INDEX,
              "BK7258 RPTUN logical mailbox channel drift");
static_assert(GET_LOG_CHNL_ID(BK7258_PM_WAKE_MBOX_CHANNEL) == 2u,
              "BK7258 PM wake logical mailbox channel drift");

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct bk7258_rptun_mbox_message_s
{
  uint32_t type;
  uint32_t generation;
  uint32_t value;
};

/****************************************************************************
 * Private Data
 ****************************************************************************/

static sem_t g_bk7258_rptun_mbox_sem;
static sem_t g_bk7258_rptun_probe_sem;
static spinlock_t g_bk7258_rptun_mbox_lock = SP_UNLOCKED;
static struct bk7258_rptun_mbox_message_s
  g_bk7258_rptun_mbox_messages[BK7258_RPTUN_MBOX_TYPE_COUNT];
static uint32_t g_bk7258_rptun_mbox_pending;
static uint32_t g_bk7258_rptun_lifecycle_event;
#ifndef CONFIG_BK7258_AP_CORE
static uint32_t g_bk7258_rptun_probe_reply;
static uint32_t g_bk7258_rptun_probe_sequence;
#endif
static uint32_t g_bk7258_rptun_notify_generation;
static uint32_t g_bk7258_rptun_notify_value;
static bool g_bk7258_rptun_notify_pending;
static volatile bool g_bk7258_rptun_pm_prepare_pending;
static volatile bool g_bk7258_rptun_pm_release_pending;
#ifdef CONFIG_BK7258_AP_CORE
static volatile bool g_bk7258_pm_peer_release_pending;
#endif
static volatile bool g_bk7258_rptun_tx_active;
static bk7258_rptun_notify_t g_bk7258_rptun_notify;
static pid_t g_bk7258_rptun_mbox_worker = INVALID_PROCESS_ID;
static bool g_bk7258_rptun_mbox_initialized;

/****************************************************************************
 * Private Functions
 ****************************************************************************/

#if defined(CONFIG_BK7258_AP_CORE) && defined(CONFIG_BK7258_RPTUN)
static inline void bk7258_rptun_mbox_mark(uint32_t flag)
{
  volatile struct bk7258_rptun_control_s *control =
    bk7258_rptun_control();

  __atomic_fetch_or((uint32_t *)(uintptr_t)&control->flags,
                    flag, __ATOMIC_RELEASE);
}
#else
#  define bk7258_rptun_mbox_mark(flag) do { } while (0)
#endif

static void bk7258_rptun_mbox_receive(void *arg, mb_chnl_cmd_t *command)
{
  struct bk7258_rptun_mbox_message_s message;
  mb_chnl_ack_t *ack = (mb_chnl_ack_t *)command;
  irqstate_t flags;

  (void)arg;

  if (command == NULL)
    {
      return;
    }

  if (command->hdr.cmd != BK7258_RPTUN_MBOX_COMMAND ||
      command->param1 == BK7258_RPTUN_MBOX_INVALID ||
      command->param1 >= BK7258_RPTUN_MBOX_TYPE_COUNT)
    {
      ack->ack_state = ACK_STATE_FAIL;
      return;
    }

  message.type = command->param1;
  message.generation = command->param2;
  message.value = command->param3;
  ack->ack_state = ACK_STATE_COMPLETE;

  /* The SDK invokes this callback inside its logical-channel MBOX0 ISR.
   * Copy and coalesce only; generation validation and RPTUN/OpenAMP callbacks
   * belong to the worker thread.
   */

  flags = spin_lock_irqsave(&g_bk7258_rptun_mbox_lock);
  g_bk7258_rptun_mbox_messages[message.type] = message;
  g_bk7258_rptun_mbox_pending |= 1u << message.type;
  spin_unlock_irqrestore(&g_bk7258_rptun_mbox_lock, flags);
  nxsem_post(&g_bk7258_rptun_mbox_sem);
}

static void bk7258_rptun_mbox_tx_complete(void *arg, mb_chnl_ack_t *ack)
{
  /* Registering a completion callback is part of the SDK channel contract.
   * RPTUN delivery truth lives in shared pending bits, not in this ACK.
   */

  (void)arg;
  (void)ack;
  __atomic_store_n(&g_bk7258_rptun_tx_active, false, __ATOMIC_RELEASE);
  nxsem_post(&g_bk7258_rptun_mbox_sem);
}

#ifdef CONFIG_BK7258_AP_CORE
static void bk7258_pm_wake_mbox_receive(void *arg, mb_chnl_cmd_t *command)
{
  mb_chnl_ack_t *ack = (mb_chnl_ack_t *)command;
  bool valid;

  (void)arg;
  if (command == NULL)
    {
      return;
    }

  /* Match the SDK/Tuya AP PWC receiver contract.  The physical mailbox
   * interrupt has already released AP0 from deep WFI before this callback;
   * NuttX owns the resume path, so only validate and acknowledge the vendor
   * wake command here.
   */

  valid = command->hdr.cmd == BK7258_PM_SLEEP_WAKEUP_NOTIFY_CMD;
  ack->ack_state = valid ? ACK_STATE_COMPLETE : ACK_STATE_FAIL;
  if (valid)
    {
      /* The official CP restore clears its sleep vote and wakes AP0 over
       * PWC; AP0 then retries vPortYieldCore(1) until AP1 leaves WFI.  AP0
       * may have rejected its own deep entry after AP1 already committed,
       * so its ordinary post-WFI path is not guaranteed to run.  Preserve
       * the PWC edge as a worker-owned level until AP1 withdraws its AON bit.
       */

      __atomic_store_n(&g_bk7258_pm_peer_release_pending, true,
                       __ATOMIC_RELEASE);
      nxsem_post(&g_bk7258_rptun_mbox_sem);
    }
}
#endif

static int bk7258_pm_wake_mbox_send(void)
{
  mb_chnl_cmd_t command;
  int ret;

  memset(&command, 0, sizeof(command));
  command.hdr.cmd = BK7258_PM_SLEEP_WAKEUP_NOTIFY_CMD;
  ret = mb_chnl_write(BK7258_PM_WAKE_MBOX_CHANNEL, &command);
  if (ret == BK_OK)
    {
      return OK;
    }

  return ret == BK_ERR_BUSY ? -EAGAIN : -EIO;
}

static void bk7258_rptun_mbox_queue_notify(uint32_t generation,
                                           uint32_t value, bool wake)
{
  irqstate_t flags;

  flags = spin_lock_irqsave(&g_bk7258_rptun_mbox_lock);
  if (!g_bk7258_rptun_notify_pending ||
      g_bk7258_rptun_notify_generation != generation)
    {
      g_bk7258_rptun_notify_generation = generation;
      g_bk7258_rptun_notify_value = value;
    }
  else
    {
      g_bk7258_rptun_notify_value |= value;
    }

