open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/common/bk7258_rptun_mbox.c
  g_bk7258_rptun_notify_pending = true;
  spin_unlock_irqrestore(&g_bk7258_rptun_mbox_lock, flags);
  if (wake)
    {
      nxsem_post(&g_bk7258_rptun_mbox_sem);
    }
}

static void bk7258_rptun_mbox_retry_notify(void)
{
  uint32_t generation;
  uint32_t value;
  irqstate_t flags;
  bool pending;
  int ret;

  flags = spin_lock_irqsave(&g_bk7258_rptun_mbox_lock);
  pending = g_bk7258_rptun_notify_pending;
  generation = g_bk7258_rptun_notify_generation;
  value = g_bk7258_rptun_notify_value;
  g_bk7258_rptun_notify_pending = false;
  g_bk7258_rptun_notify_value = 0;
  spin_unlock_irqrestore(&g_bk7258_rptun_mbox_lock, flags);

  if (!pending)
    {
      return;
    }

  ret = bk7258_rptun_mbox_send(BK7258_RPTUN_MBOX_NOTIFY,
                                generation, value);
  if (ret == -EAGAIN)
    {
      /* The in-flight SDK slot will produce TX-complete and wake this
       * worker again.  Preserve the coalesced notify truth without spinning.
       */

      bk7258_rptun_mbox_queue_notify(generation, value, false);
    }
}

static void bk7258_rptun_mbox_retry_pm_release(void)
{
  volatile struct bk7258_rptun_control_s *control =
    bk7258_rptun_control();
  uint32_t generation;
  int ret;

  if (!__atomic_exchange_n(&g_bk7258_rptun_pm_release_pending, false,
                           __ATOMIC_ACQ_REL))
    {
      return;
    }

  generation = __atomic_load_n(
    (uint32_t *)(uintptr_t)&control->generation, __ATOMIC_ACQUIRE);
  if (generation == 0)
    {
      return;
    }

  ret = bk7258_pm_wake_mbox_send();
  if (ret == -EAGAIN)
    {
      /* The worker also polls once per millisecond, so preserving the level
       * is sufficient even if no TX-complete edge remains outstanding.
       */

      __atomic_store_n(&g_bk7258_rptun_pm_release_pending, true,
                       __ATOMIC_RELEASE);
    }
}

#ifdef CONFIG_BK7258_AP_CORE
static void bk7258_rptun_mbox_retry_pm_peer_release(void)
{
  if (!__atomic_load_n(&g_bk7258_pm_peer_release_pending,
                       __ATOMIC_ACQUIRE))
    {
      return;
    }

  if (bk7258_pm_ap_release_peer == NULL ||
      bk7258_pm_ap_release_peer())
    {
      __atomic_store_n(&g_bk7258_pm_peer_release_pending, false,
                       __ATOMIC_RELEASE);
    }
}
#endif

static void bk7258_rptun_mbox_dispatch(
  const struct bk7258_rptun_mbox_message_s *message)
{
  volatile struct bk7258_ap_boot_state_s *boot = bk7258_ap_boot_state();
  bk7258_rptun_notify_t callback;
  irqstate_t flags;

  __asm volatile ("dmb sy" ::: "memory");
  if (message->generation == 0 ||
      message->generation != boot->generation)
    {
      return;
    }

  if (message->type == BK7258_RPTUN_MBOX_LIFECYCLE)
    {
      flags = spin_lock_irqsave(&g_bk7258_rptun_mbox_lock);
      g_bk7258_rptun_lifecycle_event = message->value;
      spin_unlock_irqrestore(&g_bk7258_rptun_mbox_lock, flags);
      return;
    }

  if (message->type == BK7258_RPTUN_MBOX_NOTIFY)
    {
      flags = spin_lock_irqsave(&g_bk7258_rptun_mbox_lock);
      callback = g_bk7258_rptun_notify;
      spin_unlock_irqrestore(&g_bk7258_rptun_mbox_lock, flags);

      if (callback != NULL)
        {
          callback(message->generation, message->value);
        }

      return;
    }

  if (message->type == BK7258_RPTUN_MBOX_PM_WAKE)
    {
      /* Reaching the NuttX worker proves the SDK receive callback returned,
       * so its logical-channel ACK has already been submitted.  Only now may
       * AP0 consume PREPARE and mask mailbox interrupts for deep WFI.
       * RELEASE remains an edge-only wake operation.
       */

      if (message->value == BK7258_RPTUN_PM_WAKE_PREPARE)
        {
          __atomic_store_n(&g_bk7258_rptun_pm_prepare_pending, true,
                           __ATOMIC_RELEASE);
        }

      return;
    }

  if (message->type == BK7258_RPTUN_MBOX_PROBE)
    {
#ifdef CONFIG_BK7258_AP_CORE
      if ((message->value & BK7258_RPTUN_MBOX_PROBE_REPLY) == 0)
        {
          bk7258_rptun_mbox_send(BK7258_RPTUN_MBOX_PROBE,
                                  message->generation,
                                  message->value |
                                  BK7258_RPTUN_MBOX_PROBE_REPLY);
        }
#else
      if ((message->value & BK7258_RPTUN_MBOX_PROBE_REPLY) != 0)
        {
          flags = spin_lock_irqsave(&g_bk7258_rptun_mbox_lock);
          g_bk7258_rptun_probe_reply =
            message->value & BK7258_RPTUN_MBOX_PROBE_SEQUENCE;
          spin_unlock_irqrestore(&g_bk7258_rptun_mbox_lock, flags);
          nxsem_post(&g_bk7258_rptun_probe_sem);
        }
#endif
    }
}

static int bk7258_rptun_mbox_worker(int argc, char *argv[])
{
  struct bk7258_rptun_mbox_message_s
    messages[BK7258_RPTUN_MBOX_TYPE_COUNT];
  irqstate_t flags;
  uint32_t pending;
  unsigned int type;

  (void)argc;
  (void)argv;

  for (;;)
    {
      int ret = nxsem_tickwait_uninterruptible(
                  &g_bk7258_rptun_mbox_sem,
                  MSEC2TICK(BK7258_RPTUN_MBOX_POLL_MS));

      if (ret < 0 && ret != -ETIMEDOUT)
        {
          continue;
        }

      flags = spin_lock_irqsave(&g_bk7258_rptun_mbox_lock);
      pending = g_bk7258_rptun_mbox_pending;
      g_bk7258_rptun_mbox_pending = 0;
      memcpy(messages, g_bk7258_rptun_mbox_messages, sizeof(messages));
      spin_unlock_irqrestore(&g_bk7258_rptun_mbox_lock, flags);

      for (type = 1; type < BK7258_RPTUN_MBOX_TYPE_COUNT; type++)
        {
          if ((pending & (1u << type)) != 0)
            {
              bk7258_rptun_mbox_dispatch(&messages[type]);
            }
        }

      /* The SDK mailbox uses an edge notification over a bounded hardware
       * FIFO.  Shared RPTUN pending words are the level-triggered delivery
       * truth.  Polling the registered callback from this pinned worker
       * closes the race in which an accepted mailbox edge is coalesced or
       * missed: a zero notify consumes any shared incoming bits and also
       * gives the RPTUN wrapper a chance to re-arm outstanding outgoing
       * bits.  The callback returns immediately when neither direction is
       * pending.
       */

      if (ret == -ETIMEDOUT)
        {
          bk7258_rptun_notify_t callback;
          uint32_t generation = bk7258_ap_boot_state()->generation;

          flags = spin_lock_irqsave(&g_bk7258_rptun_mbox_lock);
          callback = g_bk7258_rptun_notify;
          spin_unlock_irqrestore(&g_bk7258_rptun_mbox_lock, flags);
          if (callback != NULL && generation != 0)
            {
              callback(generation, 0);
            }
        }

