open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/common/bk7258_rptun_mbox.c
      /* RELEASE must outrank a coalesced RPTUN notify.  The AP may already
       * have masked all sources except mailbox while CP is unwinding a
       * failed coordinated-sleep attempt.
       */

#ifdef CONFIG_BK7258_AP_CORE
      bk7258_rptun_mbox_retry_pm_peer_release();
#endif
      bk7258_rptun_mbox_retry_pm_release();
      bk7258_rptun_mbox_retry_notify();
    }

  return OK;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

int bk7258_rptun_mbox_initialize(void)
{
  cpu_set_t cpuset;
  pid_t pid;
  int ret;

  if (g_bk7258_rptun_mbox_initialized)
    {
      return OK;
    }

  nxsem_init(&g_bk7258_rptun_mbox_sem, 0, 0);
  nxsem_init(&g_bk7258_rptun_probe_sem, 0, 0);
  bk7258_rptun_mbox_mark(BK7258_RPTUN_FLAG_AP_MBOX_SEMS);
  pid = kthread_create(BK7258_RPTUN_MBOX_WORKER_NAME,
                       CONFIG_BK7258_RPTUN_RX_PRIORITY,
                       CONFIG_BK7258_RPTUN_RX_STACKSIZE,
                       bk7258_rptun_mbox_worker, NULL);
  if (pid < 0)
    {
      nxsem_destroy(&g_bk7258_rptun_mbox_sem);
      nxsem_destroy(&g_bk7258_rptun_probe_sem);
      return (int)pid;
    }

  bk7258_rptun_mbox_mark(BK7258_RPTUN_FLAG_AP_MBOX_THREAD);

#ifdef CONFIG_SMP
  CPU_ZERO(&cpuset);
  CPU_SET(0, &cpuset);
  ret = sched_setaffinity(pid, sizeof(cpuset), &cpuset);
  if (ret < 0)
    {
      kthread_delete(pid);
      nxsem_destroy(&g_bk7258_rptun_mbox_sem);
      nxsem_destroy(&g_bk7258_rptun_probe_sem);
      return ret;
    }

  bk7258_rptun_mbox_mark(BK7258_RPTUN_FLAG_AP_MBOX_PINNED);
#else
  (void)cpuset;
#endif

  ret = mb_chnl_init();
  if (ret != BK_OK)
    {
      kthread_delete(pid);
      nxsem_destroy(&g_bk7258_rptun_mbox_sem);
      nxsem_destroy(&g_bk7258_rptun_probe_sem);
      return -EIO;
    }

  bk7258_rptun_mbox_mark(BK7258_RPTUN_FLAG_AP_MBOX_INIT);

  /* The vendor low-voltage leaf sends PM_SLEEP_WAKEUP_NOTIFY_CMD over the
   * dedicated, higher-priority MB_CHNL_PWC channel.  The full SDK PM stack
   * normally opens it from pm_cp0_mailbox_init()/pm_cp1_mailbox_init(); the
   * NuttX wrapper deliberately does not start that policy stack, so it must
   * claim just this hardware channel itself.
   */

  ret = mb_chnl_open(BK7258_PM_WAKE_MBOX_CHANNEL, NULL);
  if (ret != BK_OK)
    {
      kthread_delete(pid);
      nxsem_destroy(&g_bk7258_rptun_mbox_sem);
      nxsem_destroy(&g_bk7258_rptun_probe_sem);
      return -EIO;
    }

#ifdef CONFIG_BK7258_AP_CORE
  ret = mb_chnl_ctrl(BK7258_PM_WAKE_MBOX_CHANNEL, MB_CHNL_SET_RX_ISR,
                     (void *)bk7258_pm_wake_mbox_receive);
  if (ret != BK_OK)
    {
      mb_chnl_close(BK7258_PM_WAKE_MBOX_CHANNEL);
      kthread_delete(pid);
      nxsem_destroy(&g_bk7258_rptun_mbox_sem);
      nxsem_destroy(&g_bk7258_rptun_probe_sem);
      return -EIO;
    }
#endif

  ret = mb_chnl_open(BK7258_RPTUN_MBOX_CHANNEL, NULL);
  if (ret != BK_OK)
    {
      mb_chnl_close(BK7258_PM_WAKE_MBOX_CHANNEL);
      kthread_delete(pid);
      nxsem_destroy(&g_bk7258_rptun_mbox_sem);
      nxsem_destroy(&g_bk7258_rptun_probe_sem);
      return -EIO;
    }

  bk7258_rptun_mbox_mark(BK7258_RPTUN_FLAG_AP_MBOX_OPEN);

  ret = mb_chnl_ctrl(BK7258_RPTUN_MBOX_CHANNEL, MB_CHNL_SET_RX_ISR,
                     (void *)bk7258_rptun_mbox_receive);
  if (ret == BK_OK)
    {
      ret = mb_chnl_ctrl(BK7258_RPTUN_MBOX_CHANNEL,
                         MB_CHNL_SET_TX_CMPL_ISR,
                         (void *)bk7258_rptun_mbox_tx_complete);
    }

  if (ret != BK_OK)
    {
      mb_chnl_close(BK7258_RPTUN_MBOX_CHANNEL);
      mb_chnl_close(BK7258_PM_WAKE_MBOX_CHANNEL);
      kthread_delete(pid);
      nxsem_destroy(&g_bk7258_rptun_mbox_sem);
      nxsem_destroy(&g_bk7258_rptun_probe_sem);
      return -EIO;
    }

#ifdef CONFIG_BK7258_AP_CORE
  /* CP's SDK Flash driver sends start/finish on MB_CHNL_FLASH. The normal
   * SDK Flash-client init registers this receiver; NuttX intentionally does
   * not create that parallel storage client. Initialize just the actual SDK
   * notification leaf so CP receives its peer's completion ACK. This is not
   * a remote-CPU/XIP pause: media/storage admission remains with its owners.
   */

  ret = mb_flash_ipc_init();
  if (ret != BK_OK)
    {
      mb_chnl_close(MB_CHNL_FLASH);
      mb_chnl_close(BK7258_RPTUN_MBOX_CHANNEL);
      mb_chnl_close(BK7258_PM_WAKE_MBOX_CHANNEL);
      kthread_delete(pid);
      nxsem_destroy(&g_bk7258_rptun_mbox_sem);
      nxsem_destroy(&g_bk7258_rptun_probe_sem);
      return -EIO;
    }
#endif

  bk7258_rptun_mbox_mark(BK7258_RPTUN_FLAG_AP_MBOX_CBS);

  g_bk7258_rptun_mbox_worker = pid;
  g_bk7258_rptun_mbox_initialized = true;
  return OK;
}

int bk7258_rptun_mbox_send(uint32_t type, uint32_t generation,
                           uint32_t value)
{
  mb_chnl_cmd_t command;
  int ret;

  if (!g_bk7258_rptun_mbox_initialized)
    {
      return -ENODEV;
    }

  if (type == BK7258_RPTUN_MBOX_INVALID ||
      type >= BK7258_RPTUN_MBOX_TYPE_COUNT || generation == 0)
    {
      return -EINVAL;
    }

  memset(&command, 0, sizeof(command));
  command.hdr.cmd = BK7258_RPTUN_MBOX_COMMAND;
  command.param1 = type;
  command.param2 = generation;
  command.param3 = value;

  /* mb_chnl_write() owns its critical section and AP SMP spinlock. */

  __atomic_store_n(&g_bk7258_rptun_tx_active, true, __ATOMIC_RELEASE);
  ret = mb_chnl_write(BK7258_RPTUN_MBOX_CHANNEL, &command);
  if (ret == BK_OK)
    {
      return OK;
    }

  __atomic_store_n(&g_bk7258_rptun_tx_active, false, __ATOMIC_RELEASE);

  return ret == BK_ERR_BUSY ? -EAGAIN : -EIO;
}

int bk7258_rptun_mbox_notify(uint32_t generation, uint32_t value)
{
  int ret;

#if defined(CONFIG_BK7258_PM_COORDINATED_STANDBY) && \
    !defined(CONFIG_BK7258_AP_CORE)
  volatile struct bk7258_rptun_control_s *control =
    bk7258_rptun_control();

  /* The shared pending words are the level-triggered delivery truth.  During
   * cold start the CP and AP virtio endpoints can notify simultaneously, but
   * the SDK logical mailbox has only one in-flight slot per peer.  Let the AP
   * consume CP-to-AP startup data from the shared level and retain the
   * physical AP-to-CP edge: this removes the symmetric single-slot deadlock.
   * Once Name Service proves CONNECTED, restore physical edges in both
   * directions; the shared pending words still repair a coalesced edge.
   */

  if (!g_bk7258_rptun_mbox_initialized)
    {
      return -ENODEV;
    }

  if (generation == 0 || value == 0)
    {
      return -EINVAL;
    }

  if (__atomic_load_n((uint32_t *)(uintptr_t)&control->state,
                      __ATOMIC_ACQUIRE) != BK7258_RPTUN_STATE_CONNECTED)
    {
      return OK;
    }
#endif

  ret = bk7258_rptun_mbox_send(BK7258_RPTUN_MBOX_NOTIFY,
                                generation, value);
  if (ret == -EAGAIN)
    {
      bk7258_rptun_mbox_queue_notify(generation, value, true);
      return OK;
    }

  return ret;
}

