open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/common/bk7258_rptun_mbox.c
int bk7258_rptun_mbox_probe(uint32_t count, uint32_t timeout_ms)
{
#ifdef CONFIG_BK7258_AP_CORE
  return -ENOSYS;
#else
  volatile struct bk7258_ap_boot_state_s *boot = bk7258_ap_boot_state();
  clock_t timeout;
  irqstate_t flags;
  uint32_t generation;
  uint32_t reply;
  uint32_t sequence;
  uint32_t i;
  int ret;

  if (!g_bk7258_rptun_mbox_initialized)
    {
      return -ENODEV;
    }

  if (count == 0 || count > BK7258_RPTUN_MBOX_PROBE_SEQUENCE ||
      timeout_ms == 0)
    {
      return -EINVAL;
    }

  __asm volatile ("dmb sy" ::: "memory");
  generation = boot->generation;
  if (generation == 0 || boot->state != BK7258_AP_STATE_READY)
    {
      return -EHOSTDOWN;
    }

  timeout = MSEC2TICK(timeout_ms);
  if (timeout == 0)
    {
      timeout = 1;
    }

  while (nxsem_trywait(&g_bk7258_rptun_probe_sem) == OK)
    {
    }

  for (i = 0; i < count; i++)
    {
      sequence = ++g_bk7258_rptun_probe_sequence;
      if (sequence == 0 ||
          sequence > BK7258_RPTUN_MBOX_PROBE_SEQUENCE)
        {
          sequence = 1;
          g_bk7258_rptun_probe_sequence = sequence;
        }

      ret = bk7258_rptun_mbox_send(BK7258_RPTUN_MBOX_PROBE,
                                    generation, sequence);
      if (ret < 0)
        {
          return ret;
        }

      ret = nxsem_tickwait_uninterruptible(&g_bk7258_rptun_probe_sem,
                                            timeout);
      if (ret < 0)
        {
          return ret;
        }

      flags = spin_lock_irqsave(&g_bk7258_rptun_mbox_lock);
      reply = g_bk7258_rptun_probe_reply;
      spin_unlock_irqrestore(&g_bk7258_rptun_mbox_lock, flags);
      if (reply != sequence)
        {
          return -EPROTO;
        }

      __asm volatile ("dmb sy" ::: "memory");
      if (boot->generation != generation ||
          boot->state != BK7258_AP_STATE_READY)
        {
          return -ESTALE;
        }
    }

  return OK;
#endif
}

int bk7258_rptun_mbox_pm_wake(uint32_t phase)
{
  volatile struct bk7258_rptun_control_s *control =
    bk7258_rptun_control();
  uint32_t generation;
  int ret;

  if (!g_bk7258_rptun_mbox_initialized)
    {
      return -ENODEV;
    }

  if (phase != BK7258_RPTUN_PM_WAKE_PREPARE &&
      phase != BK7258_RPTUN_PM_WAKE_RELEASE)
    {
      return -EINVAL;
    }

  if (phase == BK7258_RPTUN_PM_WAKE_RELEASE)
    {
      ret = bk7258_pm_wake_mbox_send();
      if (ret == -EAGAIN)
        {
          __atomic_store_n(&g_bk7258_rptun_pm_release_pending, true,
                           __ATOMIC_RELEASE);
          nxsem_post(&g_bk7258_rptun_mbox_sem);
          return OK;
        }

      return ret;
    }

  generation = __atomic_load_n(
    (uint32_t *)(uintptr_t)&control->generation, __ATOMIC_ACQUIRE);
  if (generation == 0)
    {
      return -EHOSTDOWN;
    }

  /* The official PM code sends this edge over MB_CHNL_PWC, whose receiver is
   * installed only by the FreeRTOS AP PM stack.  NuttX owns MB_CHNL_LOG via
   * this wrapper, so using an explicit PM message here preserves the hardware
   * wake edge while also guaranteeing that the logical channel is ACKed.
   */

  ret = bk7258_rptun_mbox_send(BK7258_RPTUN_MBOX_PM_WAKE,
                                generation, phase);

  return ret;
}

bool bk7258_rptun_mbox_pm_prepare_take(void)
{
  return __atomic_exchange_n(&g_bk7258_rptun_pm_prepare_pending, false,
                             __ATOMIC_ACQ_REL);
}

uint32_t bk7258_rptun_mbox_take_lifecycle(void)
{
  irqstate_t flags;
  uint32_t event;

  flags = spin_lock_irqsave(&g_bk7258_rptun_mbox_lock);
  event = g_bk7258_rptun_lifecycle_event;
  g_bk7258_rptun_lifecycle_event = BK7258_AP_EVENT_NONE;
  spin_unlock_irqrestore(&g_bk7258_rptun_mbox_lock, flags);
  return event;
}

void bk7258_rptun_mbox_set_notify(bk7258_rptun_notify_t callback)
{
  irqstate_t flags;

  flags = spin_lock_irqsave(&g_bk7258_rptun_mbox_lock);
  g_bk7258_rptun_notify = callback;
  spin_unlock_irqrestore(&g_bk7258_rptun_mbox_lock, flags);

  /* Wake the worker after callback publication.  Validation profiles keep
   * this worker below CONFIG_RPTUN_PRIORITY so rptun_create_devices() can
   * finish first; the lower half's local bootstrap level then guarantees a
   * late all-vring pass without depending on a second mailbox edge.
   */

  if (callback != NULL)
    {
      nxsem_post(&g_bk7258_rptun_mbox_sem);
    }
}

bool bk7258_rptun_mbox_is_idle(void)
{
  irqstate_t flags;
  bool idle;
  uint8_t pwc_state;

  if (!g_bk7258_rptun_mbox_initialized ||
      __atomic_load_n(&g_bk7258_rptun_tx_active, __ATOMIC_ACQUIRE) ||
      __atomic_load_n(&g_bk7258_rptun_pm_release_pending,
                      __ATOMIC_ACQUIRE))
    {
      return false;
    }

  if (mb_chnl_ctrl(BK7258_PM_WAKE_MBOX_CHANNEL, MB_CHNL_GET_STATUS,
                   &pwc_state) != BK_OK || pwc_state != 0)
    {
      return false;
    }

  flags = spin_lock_irqsave(&g_bk7258_rptun_mbox_lock);
  idle = g_bk7258_rptun_mbox_pending == 0 &&
         !g_bk7258_rptun_notify_pending;
  spin_unlock_irqrestore(&g_bk7258_rptun_mbox_lock, flags);
  return idle;
}

#endif /* CONFIG_BK7258_RPTUN_MBOX */
